In [1]:
import pandas as pd

In [2]:
data = {'col_1' : [1, 2], 'col_2' : [3, 4]}
df = pd.DataFrame(data)
df

   col_1  col_2
0      1      3
1      2      4

In [3]:
data = pd.read_csv("../data/netflix_titles.csv")
data.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [4]:
data.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

In [5]:
data['release_year'].apply(type).unique()

array([<class 'int'>], dtype=object)

In [6]:
data.value_counts()

show_id  type   title                  director                          cast                                                                                                                                                                       country                                        date_added          release_year  rating  duration  listed_in                                         description
s10      Movie  The Starling           Theodore Melfi                    Melissa McCarthy, Chris O'Dowd, Kevin Kline, Timothy Olyphant, Daveed Diggs, Skyler Gisondo, Laura Harrier, Rosalind Chao, Kimberly Quinn, Loretta Devine, Ravi Kapoor     United States                                  September 24, 2021  2021          PG-13   104 min   Comedies, Dramas                                  A woman adjusting to life after a loss contends with a feisty bird that's taken over her garden — and a husband who's struggling to find a way forward.    1
s1000    Movie  Stowaway               Joe Penna                         Anna Kendrick, Toni Collette, Daniel Dae Kim, Shamier Anderson                                                                                                             Germany, United States                         April 22, 2021      2021          TV-MA   116 min   Dramas, International Movies, Thrillers           A three-person crew on a mission to Mars faces an impossible choice when an unplanned passenger jeopardizes the lives of everyone on board.                1
s1002    Movie  Oloibiri               Curtis Graham                     Olu Jacobs, Richard Mofe-Damijo, William R. Moses, Taiwo Ajai-Lycett, Ifeanyi Williams, Ivie Okujaye, Dayton Sinkia, Bradley Gordon                                        Canada, Nigeria, United States                 April 21, 2021      2015          TV-14   86 min    Dramas, International Movies, Thrillers           After drilling depletes a small village, a corporation finds more oil in the region, igniting tensions among the community.                                1
s1003    Movie  Tell Me When           Gerardo Gatica                    Jesús Zavala, Ximena Romo, Verónica Castro, José Carlos Ruiz, Gabriel Nuncio, Rosa María Bianchi, Héctor Bonilla, Andrés Almeida                                           Mexico                                         April 21, 2021      2021          TV-MA   97 min    Comedies, International Movies                    Workaholic Will puts his humdrum life in LA on hold to fulfill his grandpa's last wish: visiting Mexico City's most iconic sights and falling in love.     1
s1014    Movie  Miss Sloane            John Madden                       Jessica Chastain, Mark Strong, Gugu Mbatha-Raw, Michael Stuhlbarg, Raoul Bhaneja, John Lithgow, Sam Waterston, Chuck Shamata, Jake Lacy, Alison Pill, David Wilson Barnes  France, United States, United Kingdom, Canada  April 19, 2021      2016          R       132 min   Thrillers                                         A tenacious Capitol Hill lobbyist with a well-earned reputation for winning takes on the most challenging battle of her career.                            1
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   ..
s991     Movie  Niyazi Gül Dörtnala    Hakan Algül                       Ata Demirer, Demet Akbağ, Şebnem Bozoklu, Levent Ülgen                                                                                                                     Turkey                                         April 23, 2021      2015          TV-MA   102 min   Comedies, International Movies                    Seeking the formula behind a magical elixir bequeathed to him by his father, a veterinary professor gets embroiled in a mobster's horse-racing scheme.     1
s992     Movie  One Like It            Marwan Nabil                      Riham Abdel Ghafour, Mohammed Aly Rizk, Hazem Samir, Salwa Othman, Mahmoud Gharib                                                                                          Egypt                                          April 23, 2021      2020          TV-G    15 min    Dramas, Independent Movies, International Movies  This short film follows a day in the life of a young woman in Egypt and how her interactions with others expose long-standing stereotypes and biases.      1
s995     Movie  This Lady Called Life  Kayode Kasum                      Bisola Aiyeola, Efa Iwara, Molawa Onajobi, Tina Mba, Wale Ojo, Jemima Osunde, Lota Chukwu, Samuel Asa'ah, Michael Ejoor, Uche Elumelu                                      Nigeria                                        April 23, 2021      2020          TV-14   120 min   Dramas, International Movies, Romantic Movies     Abandoned by her family, young single mother Aiye struggles to survive but stays focused on her dream of becoming an elite chef.                           1
s996     Movie  Vizontele              Yılmaz Erdoğan, Ömer Faruk Sorak  Yılmaz Erdoğan, Demet Akbağ, Altan Erkekli, Cem Yılmaz, Cezmi Baskın, Bican Günalan, Sebnem Sönmez, İclal Aydın, Mesut Çakarli, Zeynep Tokuş                               Turkey                                         April 23, 2021      2001          TV-MA   106 min   Comedies, Dramas, International Movies            In 1974, a rural town in Anatolia gets its first television set – an event that's met with both excitement and trepidation by the villagers.               1
s997     Movie  HOMUNCULUS             Takashi Shimizu                   Go Ayano, Ryo Narita, Yukino Kishii, Anna Ishii, Seiyo Uchino                                                                                                              Japan                                          April 22, 2021      2021          TV-MA   116 min   Horror Movies, International Movies, Thrillers    Truth and illusion blurs when a homeless amnesiac awakens from an experimental medical procedure with the ability to see people's innermost traumas.       1
Name: count, Length: 5332, dtype: int64

In [12]:
# Dataframe de planetas

# Definir los datos de los planetas (nombre, radio en kilómetros, número de lunas)
data = {
    "Planeta": ["Mercurio", "Venus", "Tierra", "Marte", "Júpiter", "Saturno", "Urano", "Neptuno"],
    "Radio_km": [2439.7, 6051.8, 6371, 3389.5, 69911, 58232, 25362, 24622],
    "Lunas": [0, 0, 1, 2, 80, 83, 27, 14],
    "Tipo": ['Terrestre', 'Terrestre', 'Terrestre', 'Terrestre', 'Gigante de gas', 'Gigante de gas', 'Gigante de Hielo', 'Gigante de Hielo'],
    "Anillos": ['no', 'no', 'no', 'no', 'si', 'si', 'si', 'si'],
    "Temperatura_media_c": [167, 464, 15, -65, -110, -140, -195, -200],
    "Campo_magnetico": ['si', 'no', 'si', 'no', 'si', 'si', 'si', 'si']
}

# Crear el DataFrame
planetas = pd.DataFrame(data)

# Mostrar el DataFrame
print(planetas)

    Planeta  Radio_km  Lunas              Tipo Anillos  Temperatura_media_c  \
0  Mercurio    2439.7      0         Terrestre      no                  167
1     Venus    6051.8      0         Terrestre      no                  464
2    Tierra    6371.0      1         Terrestre      no                   15
3     Marte    3389.5      2         Terrestre      no                  -65
4   Júpiter   69911.0     80    Gigante de gas      si                 -110
5   Saturno   58232.0     83    Gigante de gas      si                 -140
6     Urano   25362.0     27  Gigante de Hielo      si                 -195
7   Neptuno   24622.0     14  Gigante de Hielo      si                 -200

  Campo_magnetico
0              si
1              no
2              si
3              no
4              si
5              si
6              si
7              si

In [8]:
# Planetas que tengan menos de 20 Lunas
planetas[planetas["Lunas"] < 20]

    Planeta  Radio_km  Lunas
0  Mercurio    2439.7      0
1     Venus    6051.8      0
2    Tierra    6371.0      1
3     Marte    3389.5      2
7   Neptuno   24622.0     14

In [9]:
# Planetas que tengan menos de 10 Lunas o más de 50 Lunas
planetas[(planetas["Lunas"] < 10) | (planetas["Lunas"] > 50)]

    Planeta  Radio_km  Lunas
0  Mercurio    2439.7      0
1     Venus    6051.8      0
2    Tierra    6371.0      1
3     Marte    3389.5      2
4   Júpiter   69911.0     80
5   Saturno   58232.0     83

In [10]:
# Planetas con mas de 20 lunas, pero no planetas que tengan 80 ni radio inferior a 50000km
planetas[(planetas["Lunas"] > 20) & ~(planetas["Lunas"] == 80) & ~(planetas["Radio_km"] < 50000)]

   Planeta  Radio_km  Lunas
5  Saturno   58232.0     83

In [11]:
# Solamente filtrar
planetas.loc[(planetas["Lunas"] > 20) & ~(planetas["Lunas"] == 80) & ~(planetas["Radio_km"] < 50000), "Planeta"]

5    Saturno
Name: Planeta, dtype: object

In [20]:
# Groupby
planetas.groupby(['Tipo']).sum(numeric_only=True)

                  Radio_km  Lunas  Temperatura_media_c
Tipo
Gigante de Hielo   49984.0     41                 -395
Gigante de gas    128143.0    163                 -250
Terrestre          18252.0      3                  581

In [23]:
# Groupby
planetas.groupby(['Tipo', 'Campo_magnetico']).mean(numeric_only= True)

                                  Radio_km  Lunas  Temperatura_media_c
Tipo             Campo_magnetico
Gigante de Hielo si               24992.00   20.5               -197.5
Gigante de gas   si               64071.50   81.5               -125.0
Terrestre        no                4720.65    1.0                199.5
                 si                4405.35    0.5                 91.0

In [ ]:
# Agrupar planetas por su tipo y calcular valores medios y medianos
planetas.groupby(['Tipo'])[planetas.select_dtypes(include=['number']).columns].agg(['mean', 'median'])

                 Radio_km            Lunas        Temperatura_media_c
                     mean    median   mean median                mean median
Tipo
Gigante de Hielo  24992.0  24992.00  20.50   20.5             -197.50 -197.5
Gigante de gas    64071.5  64071.50  81.50   81.5             -125.00 -125.0
Terrestre          4563.0   4720.65   0.75    0.5              145.25   91.0

In [ ]:
planetas.groupby(["Tipo"]).size()

Tipo
Gigante de Hielo    2
Gigante de gas      2
Terrestre           4
dtype: int64